leftovers-soapdata.rb

 <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <m:geocode xmlns:m="http://rpc.geocoder.us/Geo/Coder/US/">
      <location xsi:type="xsd:string">1005 Gravenstein Highway North Sebastopol, CA 95472</location>
    </m:geocode>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
